python.tex
% Created 2020-07-29 Wed 14:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\usepackage{minted}
\usepackage[a4paper, total={6in, 9.1in}]{geometry}
\usemintedstyle{emacs}
\author{Nebhrajani A. V.}
\date{}
\title{Python IP Class Notebook}
\hypersetup{
 pdfauthor={Nebhrajani A. V.},
 pdftitle={Python IP Class Notebook},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.3.6)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newpage

\section{Preamble}
\label{sec:orgacb1b1d}
\subsection{Notebook Conventions}
\label{sec:org7b4e3e0}
All code in this notebook is in Python unless specified otherwise.
All code is syntax-highlighted, placed in boxes, and is line
numbered. The output of the interpreter on \texttt{stdout} is printed directly below it,
\texttt{verbatim}, thus.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
# Print Hello world!
print("Hello world!")
\end{minted}

\begin{verbatim}
Hello world!
\end{verbatim}


It is recommended that you navigate using the hyperlinked TOC or the Adobe
Bookmarks tree.

\subsection{Hardware and Software Used}
\label{sec:org2eb6899}

 This notebook is written in an \texttt{org-mode} file and exported via \LaTeX{}, Org version 9.3.6 on
GNU Emacs 25.2.2 (x86\_ 64-pc-linux-gnu, GTK+ Version 3.22.21) of
2017-09-23, modified by Debian, on a Foxconn Core i7 NanoPC running Linux
Mint 19.3 XFCE 64-bit. Python 2.7.17 of 2020-04-15 is used
throughout unless specified otherwise. For the Org or \LaTeX{} source, contact
\href{mailto:aditya.v.nebhrajani@gmail.com}{aditya.v.nebhrajani@gmail.com}.

\subsection{Acknowledgements}
\label{sec:orgefa20cb}
I am grateful to the FSF, the GNU Project, the Linux foundation,
the Emacs, StackExchange and FLOSS communities, and my father,
who taught me that a world outside commercialized technology does
exist and thrive.
\newpage

\section{NumPy}
\label{sec:orgd4bab29}
\subsection{Worksheet 2020-07-26}
\label{sec:orgccc6e82}

\begin{enumerate}
\item Create an ndarray with values ranging from 10 to 49 each spaced with a difference of 3.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
arr=np.arange(10,50,3,dtype=int)
print(arr)
\end{minted}

\begin{verbatim}
[10 13 16 19 22 25 28 31 34 37 40 43 46 49]
\end{verbatim}

\item Find the output of the following Python code:

\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
x="hello world"
print(x[:2],x[:-2],x[-2:])
\end{minted}

\begin{verbatim}
('he', 'hello wor', 'ld')
\end{verbatim}

\item Predict the output of the following code fragments:

\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
x=np.array([1,2,3])
y=np.array([3,2,1])
z=np.concatenate([x,y])
print(z)
\end{minted}

\begin{verbatim}
[1 2 3 3 2 1]
\end{verbatim}

\item Consider following two arrays: Array1=
array([0,1,2],[3,4,5],[6,7,8]]) and Array2=
array([10,11,12],[13,14,15],[16,17,18]]). Write NumPy command to concatenate Array1 and Array2:

\begin{enumerate}
\item Row wise
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
Array1= np.array([[0,1,2],[3,4,5],[6,7,8]])
Array2= np.array([[10,11,12],[13,14,15],[16,17,18]])
rarr=np.concatenate([Array1,Array2],axis=1)
print(rarr)
\end{minted}

\begin{verbatim}
[[ 0  1  2 10 11 12]
 [ 3  4  5 13 14 15]
 [ 6  7  8 16 17 18]]
\end{verbatim}

\item Column wise
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
Array1= np.array([[0,1,2],[3,4,5],[6,7,8]])
Array2= np.array([[10,11,12],[13,14,15],[16,17,18]])
carr=np.concatenate([Array1,Array2],axis=0)
print(carr)
\end{minted}

\begin{verbatim}
[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [10 11 12]
 [13 14 15]
 [16 17 18]]
\end{verbatim}
\end{enumerate}

\item To create sequences of numbers, NumPy provides a function \uline{(a)arange} analogous to range that returns arrays instead of lists.

\item Find the output of following program.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
a=np.array([30,60,70,30,10,86,45])
print(a[-2:6])
\end{minted}

\begin{verbatim}
[86]
\end{verbatim}

\item Write a NumPy program to create a 2d array with 1 on the border and 0 inside.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
x = np.ones((5,5))
print("Original array:")
print(x)
print("1 on the border and 0 inside in the array")
x[1:-1,1:-1] = 0
print(x)
\end{minted}

\begin{verbatim}
Original array:
[[1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]]
1 on the border and 0 inside in the array
[[1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1.]]
\end{verbatim}

\item Given following ndarray A: ([[2, 4, 6], [7, 8, 9], [1, 2, 3]])
Write the python statements to perform the array slices in the
way so as to extract first row and second column.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
A = np.array([[2,4,6],[7,8,9],[1,2,3]])
print(A[0,:])
print(A[:,1])
\end{minted}

\begin{verbatim}
[2 4 6]
[4 8 2]
\end{verbatim}

\item Write python statement to create a two- dimensional array of 4 rows and 3 columns. The array should be filled with ones.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
x = np.ones((4,3))
print(x)
\end{minted}

\begin{verbatim}
[[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]
\end{verbatim}

\item Find the output of following program.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
d = np.array([10,20,30,40,50,60,70])
print(d[-5:])
\end{minted}

\begin{verbatim}
[30 40 50 60 70]
\end{verbatim}

\item State at least two differences between a NumPy array and a list
\begin{center}
\begin{tabular}{|l|l|}
\hline
NumPy Array & List\\
\hline
By default, numpy arrays are homogeneous & They can have elements of different data types\\
Element-wise operations are possible & Element-wise operations don’t work on lists\\
They take up less space & They take up more space\\
\hline
\end{tabular}
\end{center}

\item Find the output of following program.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
d=np.array([10,20,30,40,50,60,70])
print(d[-1:-4:-1])
\end{minted}

\begin{verbatim}
[70 60 50]
\end{verbatim}

\item Write the output of the following code.
\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
a=[[1,2,3,4],[5,6,7,8]]
b=[[1,2,3,4],[5,6,7,8]]
n=np.concatenate((a, b), axis=0)
print(n[1])
print(n[1][1])
\end{minted}

\begin{verbatim}
[5 6 7 8]
6
\end{verbatim}

\item Which of the following is contained in NumPy library?
\begin{enumerate}
\item \textbf{N-Dimensional Array Object}
\item Series
\item DataFrame
\item Plot
\end{enumerate}

\item Point out the correct statement:
\begin{enumerate}
\item NumPy main object is the homogeneous multidimensional array
\item In Numpy, dimensions are called axes
\item NumPy array class is called ndarray
\item \textbf{All of the above}
\end{enumerate}

\item When the fromiter() is preferred over array()?
\textbf{A:} Fromiter() is preferred over array()for creating non-numeric
sequences like strings and dictionaries.

\item What is the purpose of order argument in empty(). What do ‘C’
and ‘F’ stands for? What is the default value of order
argument?
\textbf{A:} The “order” argument arranges the elements of the
array row-wise or column-wise. C order arranges elements column
wise and means “c”-like, whereas F order arranges elements row
wise and means “fortran”-like. Default value of order argument
is C.

\item Differentiate split() from hsplit() and vsplit().
\textbf{A:} Split() function is a general function which can be used to split an
array in numpy both horizontally and vertically by providing an
axis. If the axis is 0 it is the same as hsplit() and if the
axis is 1 it behaves as vsplit(). The difference between
split() and hsplit(),vsplit() is that split() allows you to
specify the axis that you wish, and hsplit() and vsplit() are
for specific axes.

\item Find the output:
\begin{enumerate}
\item \begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
a = np.linspace(2.5,5,6)
print(a)
\end{minted}

\begin{verbatim}
[2.5 3.  3.5 4.  4.5 5. ]
\end{verbatim}

\item \begin{minted}[,frame=single, framesep=10pt, linenos]{python}
import numpy as np
a=np.array([[0,2,4,6],[8,10,12,14],[16,18,20,22],[24,26,28,30]])
print(a)
print(a[:3,3:])
print(a[1::2,:3])
print(a[-3:-1,-4::2])
print(a[::-1,::-1])
\end{minted}

\begin{verbatim}
[[ 0  2  4  6]
 [ 8 10 12 14]
 [16 18 20 22]
 [24 26 28 30]]
[[ 6]
 [14]
 [22]]
[[ 8 10 12]
 [24 26 28]]
[[ 8 12]
 [16 20]]
[[30 28 26 24]
 [22 20 18 16]
 [14 12 10  8]
 [ 6  4  2  0]]
\end{verbatim}
\end{enumerate}
\end{enumerate}

\section{Pandas}
\label{sec:org340608d}
\subsection{Series}
\label{sec:orgbc9c94b}

\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
# Import numpy and pandas
import pandas as pd
import numpy as np

# Create an empty series
s = pd.Series()
print(s)

# Series from ndarray
data = np.array(['a', 'b', 'c', 'd'])

## Without index
s = pd.Series(data)
print(s)
## With index
s = pd.Series(data, index = [100, 101, 102, 103])
print(s)

# Scalar series
s = pd.Series(5, index = [0, 1, 2, 3])
print(s)

# Series from dictionary
data = {'a' : 0., 'b' : 1., 'c' : 2.}

## Without index
s = pd.Series(data)
print(s)
## With index
s = pd.Series(data, index = ['b', 'c', 'd', 'a'])
print(s)

# Another dictionary example
f_dict = {'apples': 500, 'kiwi': 20, 'oranges': 100, 'cherries': 6000}
print(f_dict)

arr = pd.Series(f_dict)
print('\nArray Items')
print(arr)
\end{minted}

\begin{verbatim}
Series([], dtype: float64)
0    a
1    b
2    c
3    d
dtype: object
100    a
101    b
102    c
103    d
dtype: object
0    5
1    5
2    5
3    5
dtype: int64
a    0.0
b    1.0
c    2.0
dtype: float64
b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64
{'kiwi': 20, 'cherries': 6000, 'apples': 500, 'oranges': 100}

Array Items
apples       500
cherries    6000
kiwi          20
oranges      100
dtype: int64
\end{verbatim}

\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
# Indexing
import pandas as pd
from pandas import Series
arr = Series([22, 44, 66, 88, 108])
print(arr[[1, 3, 0, 4]])
\end{minted}

\begin{verbatim}
1     44
3     88
0     22
4    108
dtype: int64
\end{verbatim}


\begin{minted}[,frame=single, framesep=10pt, linenos]{python}
# Series operations
import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
print(ds1)
print(ds2)
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)
\end{minted}

\begin{verbatim}
0     2
1     4
2     6
3     8
4    10
dtype: int64
0    1
1    3
2    5
3    7
4    9
dtype: int64
Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64
\end{verbatim}
\end{document}